huigg296/servo-control-course/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MKV30F64xxx10
package_id: MKV30F64VLF10
mcu_data: ksdk2_0
processor_version: 15.0.1
pin_labels:
- {pin_num: '21', pin_signal: PTA4/LLWU_P3/FTM0_CH1/FTM0_FLT3/NMI_b, label: S2, identifier: S2}
- {pin_num: '29', pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/FTM0_FLT3, label: S8, identifier: S8}
- {pin_num: '30', pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, label: S3, identifier: S3}
- {pin_num: '31', pin_signal: PTB16/UART0_RX/FTM_CLKIN0/EWM_IN, label: S7, identifier: S7}
- {pin_num: '32', pin_signal: PTB17/UART0_TX/FTM_CLKIN1/EWM_OUT_b, label: BUZZ, identifier: BUZZ}
- {pin_num: '33', pin_signal: ADC0_SE14/PTC0/SPI0_PCS4/PDB0_EXTRG/CMP0_OUT/FTM0_FLT1/SPI0_PCS0, label: LED, identifier: LED}
- {pin_num: '34', pin_signal: ADC0_SE15/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FTM2_CH0, label: IS2, identifier: IS2}
- {pin_num: '35', pin_signal: ADC0_SE4b/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FTM2_CH1, label: S9, identifier: S9}
- {pin_num: '36', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT, label: UART1_RX, identifier: UART1_RX}
- {pin_num: '37', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/CMP1_OUT, label: UART1_TX, identifier: UART1_TX}
- {pin_num: '38', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/CMP0_OUT/FTM0_CH2, label: EN2, identifier: EN2}
- {pin_num: '39', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/UART0_RX/I2C0_SCL, label: IS1, identifier: IS1}
- {pin_num: '40', pin_signal: CMP0_IN1/PTC7/SPI0_SIN/UART0_TX/I2C0_SDA, label: EN1, identifier: EN1}
- {pin_num: '41', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART0_RTS_b/FTM0_CH0/UART1_RX, label: PWM0, identifier: PWM1;PWM0}
- {pin_num: '42', pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/UART0_CTS_b/FTM0_CH1/UART1_TX, label: PWM1, identifier: PWM2;PWM1}
- {pin_num: '43', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART0_RX/FTM0_CH2/I2C0_SCL, label: PWM2, identifier: PWM3;PWM2}
- {pin_num: '44', pin_signal: PTD3/SPI0_SIN/UART0_TX/FTM0_CH3/I2C0_SDA, label: PWM3, identifier: PWM4;PWM3}
- {pin_num: '45', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FTM2_CH0/EWM_IN, label: PHB, identifier: PHB}
- {pin_num: '27', pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX, label: PHA1, identifier: PHA1}
- {pin_num: '28', pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX, label: PHB1, identifier: PHB1}
- {pin_num: '46', pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/FTM0_CH5/FTM2_CH1/EWM_OUT_b, label: PHA, identifier: PHA}
- {pin_num: '47', pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH0/FTM1_CH0/FTM0_FLT0, label: PUSH, identifier: PUSH}
- {pin_num: '48', pin_signal: PTD7/UART0_TX/FTM0_CH1/FTM1_CH1/FTM0_FLT1, label: S5, identifier: S5}
- {pin_num: '3', pin_signal: ADC0_SE4a/ADC0_DP1/ADC1_DP2/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, label: PE16, identifier: PE16}
- {pin_num: '4', pin_signal: ADC0_SE5a/ADC0_DM1/ADC1_DM2/PTE17/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, label: PE17, identifier: PE17}
- {pin_num: '5', pin_signal: ADC0_SE6a/ADC1_DP1/ADC0_DP2/PTE18/SPI0_SOUT/UART1_CTS_b/I2C0_SDA, label: PE18, identifier: PE18}
- {pin_num: '6', pin_signal: ADC0_SE7a/ADC1_DM1/ADC0_DM2/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL, label: PE19, identifier: PE19}
- {pin_num: '15', pin_signal: ADC0_SE17/PTE24/FTM0_CH0/I2C0_SCL/EWM_OUT_b, label: PE24, identifier: PE24}
- {pin_num: '16', pin_signal: ADC0_SE18/PTE25/FTM0_CH1/I2C0_SDA/EWM_IN, label: S4, identifier: S4}
- {pin_num: '7', pin_signal: ADC0_DP0/ADC1_DP3, label: ADCDP, identifier: ADCDP}
- {pin_num: '8', pin_signal: ADC0_DM0/ADC1_DM3, label: ADCDM, identifier: ADCDM}
- {pin_num: '13', pin_signal: VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18, label: VREF, identifier: VREF}
- {pin_num: '14', pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23, label: VOUT, identifier: VOUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '17', peripheral: JTAG, signal: JTAG_TCLK_SWD_CLK, pin_signal: PTA0/UART0_CTS_b/FTM0_CH5/EWM_IN/JTAG_TCLK/SWD_CLK}
  - {pin_num: '18', peripheral: n/a, signal: disabled, pin_signal: PTA1/UART0_RX/FTM2_CH0/CMP0_OUT/FTM2_QD_PHA/FTM1_CH1/JTAG_TDI}
  - {pin_num: '19', peripheral: n/a, signal: disabled, pin_signal: PTA2/UART0_TX/FTM2_CH1/CMP1_OUT/FTM2_QD_PHB/FTM1_CH0/JTAG_TDO/TRACE_SWO}
  - {pin_num: '20', peripheral: JTAG, signal: JTAG_TMS_SWD_DIO, pin_signal: PTA3/UART0_RTS_b/FTM0_CH0/FTM2_FLT0/EWM_OUT_b/JTAG_TMS/SWD_DIO}
  - {pin_num: '21', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: PTA4/LLWU_P3/FTM0_CH1/FTM0_FLT3/NMI_b, direction: INPUT}
  - {pin_num: '22', peripheral: SUPPLY, signal: 'VDD, 1', pin_signal: VDD22}
  - {pin_num: '23', peripheral: SUPPLY, signal: 'VSS, 1', pin_signal: VSS23}
  - {pin_num: '1', peripheral: SUPPLY, signal: 'VDD, 0', pin_signal: VDD1}
  - {pin_num: '2', peripheral: SUPPLY, signal: 'VSS, 0', pin_signal: VSS2}
  - {pin_num: '24', peripheral: OSC, signal: EXTAL0, pin_signal: EXTAL0/PTA18/FTM0_FLT2/FTM_CLKIN0}
  - {pin_num: '25', peripheral: OSC, signal: XTAL0, pin_signal: XTAL0/PTA19/FTM0_FLT0/FTM1_FLT0/FTM_CLKIN1/LPTMR0_ALT1}
  - {pin_num: '27', peripheral: FTM1, signal: 'QD_PH, A', pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX}
  - {pin_num: '28', peripheral: FTM1, signal: 'QD_PH, B', pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX}
  - {pin_num: '29', peripheral: GPIOB, signal: 'GPIO, 2', pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/FTM0_FLT3, direction: INPUT}
  - {pin_num: '30', peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, direction: INPUT}
  - {pin_num: '31', peripheral: GPIOB, signal: 'GPIO, 16', pin_signal: PTB16/UART0_RX/FTM_CLKIN0/EWM_IN, direction: INPUT}
  - {pin_num: '32', peripheral: GPIOB, signal: 'GPIO, 17', pin_signal: PTB17/UART0_TX/FTM_CLKIN1/EWM_OUT_b, direction: OUTPUT}
  - {pin_num: '33', peripheral: GPIOC, signal: 'GPIO, 0', pin_signal: ADC0_SE14/PTC0/SPI0_PCS4/PDB0_EXTRG/CMP0_OUT/FTM0_FLT1/SPI0_PCS0, direction: OUTPUT}
  - {pin_num: '34', peripheral: GPIOC, signal: 'GPIO, 1', pin_signal: ADC0_SE15/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FTM2_CH0, direction: INPUT}
  - {pin_num: '35', peripheral: GPIOC, signal: 'GPIO, 2', pin_signal: ADC0_SE4b/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FTM2_CH1, direction: INPUT}
  - {pin_num: '36', peripheral: UART1, signal: RX, pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT}
  - {pin_num: '37', peripheral: UART1, signal: TX, pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/CMP1_OUT, direction: OUTPUT}
  - {pin_num: '38', peripheral: GPIOC, signal: 'GPIO, 5', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/CMP0_OUT/FTM0_CH2, direction: OUTPUT}
  - {pin_num: '39', peripheral: GPIOC, signal: 'GPIO, 6', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/UART0_RX/I2C0_SCL, direction: INPUT}
  - {pin_num: '40', peripheral: GPIOC, signal: 'GPIO, 7', pin_signal: CMP0_IN1/PTC7/SPI0_SIN/UART0_TX/I2C0_SDA, direction: OUTPUT}
  - {pin_num: '41', peripheral: FTM0, signal: 'CH, 0', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART0_RTS_b/FTM0_CH0/UART1_RX, identifier: PWM0, direction: OUTPUT}
  - {pin_num: '42', peripheral: FTM0, signal: 'CH, 1', pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/UART0_CTS_b/FTM0_CH1/UART1_TX, identifier: PWM1, direction: OUTPUT}
  - {pin_num: '43', peripheral: FTM0, signal: 'CH, 2', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART0_RX/FTM0_CH2/I2C0_SCL, identifier: PWM2, direction: OUTPUT}
  - {pin_num: '44', peripheral: FTM0, signal: 'CH, 3', pin_signal: PTD3/SPI0_SIN/UART0_TX/FTM0_CH3/I2C0_SDA, identifier: PWM3, direction: OUTPUT}
  - {pin_num: '45', peripheral: GPIOD, signal: 'GPIO, 4', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FTM2_CH0/EWM_IN, direction: INPUT}
  - {pin_num: '46', peripheral: GPIOD, signal: 'GPIO, 5', pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/FTM0_CH5/FTM2_CH1/EWM_OUT_b, direction: INPUT}
  - {pin_num: '47', peripheral: GPIOD, signal: 'GPIO, 6', pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH0/FTM1_CH0/FTM0_FLT0, direction: INPUT}
  - {pin_num: '48', peripheral: GPIOD, signal: 'GPIO, 7', pin_signal: PTD7/UART0_TX/FTM0_CH1/FTM1_CH1/FTM0_FLT1, direction: INPUT}
  - {pin_num: '3', peripheral: GPIOE, signal: 'GPIO, 16', pin_signal: ADC0_SE4a/ADC0_DP1/ADC1_DP2/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, direction: INPUT,
    slew_rate: slow, pull_select: down, pull_enable: enable}
  - {pin_num: '4', peripheral: GPIOE, signal: 'GPIO, 17', pin_signal: ADC0_SE5a/ADC0_DM1/ADC1_DM2/PTE17/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, direction: INPUT,
    slew_rate: slow, pull_select: down, pull_enable: enable}
  - {pin_num: '5', peripheral: GPIOE, signal: 'GPIO, 18', pin_signal: ADC0_SE6a/ADC1_DP1/ADC0_DP2/PTE18/SPI0_SOUT/UART1_CTS_b/I2C0_SDA, direction: INPUT, slew_rate: slow,
    pull_select: down, pull_enable: enable}
  - {pin_num: '6', peripheral: GPIOE, signal: 'GPIO, 19', pin_signal: ADC0_SE7a/ADC1_DM1/ADC0_DM2/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL, direction: INPUT, slew_rate: slow,
    pull_select: down, pull_enable: enable}
  - {pin_num: '15', peripheral: GPIOE, signal: 'GPIO, 24', pin_signal: ADC0_SE17/PTE24/FTM0_CH0/I2C0_SCL/EWM_OUT_b, direction: INPUT, slew_rate: slow, pull_select: down,
    pull_enable: enable}
  - {pin_num: '16', peripheral: GPIOE, signal: 'GPIO, 25', pin_signal: ADC0_SE18/PTE25/FTM0_CH1/I2C0_SDA/EWM_IN, direction: INPUT}
  - {pin_num: '7', peripheral: ADC0, signal: 'DP, 0', pin_signal: ADC0_DP0/ADC1_DP3}
  - {pin_num: '8', peripheral: ADC0, signal: 'DM, 0', pin_signal: ADC0_DM0/ADC1_DM3}
  - {pin_num: '13', peripheral: VREF, signal: OUT, pin_signal: VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18}
  - {pin_num: '14', peripheral: DAC0, signal: OUT, pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

