huigg296/servo-control-course/board/pin_mux.c
    /* PORTA19 (pin 25) is configured as XTAL0 */
    PORT_SetPinMux(PORTA, 19U, kPORT_PinDisabledOrAnalog);

    /* PORTA2 (pin 19) is disabled */
    PORT_SetPinMux(PORTA, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTA3 (pin 20) is configured as JTAG_TMS */
    PORT_SetPinMux(PORTA, 3U, kPORT_MuxAlt7);

    /* PORTA4 (pin 21) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_S2_PORT, BOARD_INITPINS_S2_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 27) is configured as FTM1_QD_PHA */
    PORT_SetPinMux(BOARD_INITPINS_PHA1_PORT, BOARD_INITPINS_PHA1_PIN, kPORT_MuxAlt6);

    /* PORTB1 (pin 28) is configured as FTM1_QD_PHB */
    PORT_SetPinMux(BOARD_INITPINS_PHB1_PORT, BOARD_INITPINS_PHB1_PIN, kPORT_MuxAlt6);

    /* PORTB16 (pin 31) is configured as PTB16 */
    PORT_SetPinMux(BOARD_INITPINS_S7_PORT, BOARD_INITPINS_S7_PIN, kPORT_MuxAsGpio);

    /* PORTB17 (pin 32) is configured as PTB17 */
    PORT_SetPinMux(BOARD_INITPINS_BUZZ_PORT, BOARD_INITPINS_BUZZ_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 29) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_S8_PORT, BOARD_INITPINS_S8_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 30) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_S3_PORT, BOARD_INITPINS_S3_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 33) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_LED_PORT, BOARD_INITPINS_LED_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 34) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_IS2_PORT, BOARD_INITPINS_IS2_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 35) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_S9_PORT, BOARD_INITPINS_S9_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 36) is configured as UART1_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART1_RX_PORT, BOARD_INITPINS_UART1_RX_PIN, kPORT_MuxAlt3);

    /* PORTC4 (pin 37) is configured as UART1_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART1_TX_PORT, BOARD_INITPINS_UART1_TX_PIN, kPORT_MuxAlt3);

    /* PORTC5 (pin 38) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_EN2_PORT, BOARD_INITPINS_EN2_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 39) is configured as PTC6 */
    PORT_SetPinMux(BOARD_INITPINS_IS1_PORT, BOARD_INITPINS_IS1_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 40) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_EN1_PORT, BOARD_INITPINS_EN1_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 41) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_PWM0_PORT, BOARD_INITPINS_PWM0_PIN, kPORT_MuxAlt4);

    /* PORTD1 (pin 42) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_PWM1_PORT, BOARD_INITPINS_PWM1_PIN, kPORT_MuxAlt4);

    /* PORTD2 (pin 43) is configured as FTM0_CH2 */
    PORT_SetPinMux(BOARD_INITPINS_PWM2_PORT, BOARD_INITPINS_PWM2_PIN, kPORT_MuxAlt4);

    /* PORTD3 (pin 44) is configured as FTM0_CH3 */
    PORT_SetPinMux(BOARD_INITPINS_PWM3_PORT, BOARD_INITPINS_PWM3_PIN, kPORT_MuxAlt4);

    /* PORTD4 (pin 45) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_PHB_PORT, BOARD_INITPINS_PHB_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 46) is configured as PTD5 */
    PORT_SetPinMux(BOARD_INITPINS_PHA_PORT, BOARD_INITPINS_PHA_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 47) is configured as PTD6 */
    PORT_SetPinMux(BOARD_INITPINS_PUSH_PORT, BOARD_INITPINS_PUSH_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 48) is configured as PTD7 */
    PORT_SetPinMux(BOARD_INITPINS_S5_PORT, BOARD_INITPINS_S5_PIN, kPORT_MuxAsGpio);

    /* PORTE16 (pin 3) is configured as PTE16 */
    PORT_SetPinMux(BOARD_INITPINS_PE16_PORT, BOARD_INITPINS_PE16_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[16] = ((PORTE->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullDown)

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE17 (pin 4) is configured as PTE17 */
    PORT_SetPinMux(BOARD_INITPINS_PE17_PORT, BOARD_INITPINS_PE17_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[17] = ((PORTE->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullDown)

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE18 (pin 5) is configured as PTE18 */
    PORT_SetPinMux(BOARD_INITPINS_PE18_PORT, BOARD_INITPINS_PE18_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[18] = ((PORTE->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullDown)

                      /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE19 (pin 6) is configured as PTE19 */
    PORT_SetPinMux(BOARD_INITPINS_PE19_PORT, BOARD_INITPINS_PE19_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[19] = ((PORTE->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullDown)

